# Data, Sample, Attribute, Target

<img src="img/data.png">

# What is Pandas?

<ul>
    <li>Data Scientists Package For Data Preprocessing.</li>
    <li>Read csv, excel, json, html, sql, ...</li>
</ul>

# How to Install Pandas

In [1]:
!pip install pandas

Requirement already satisfied: pandas in c:\users\saman\miniconda3\envs\env1\lib\site-packages (1.3.5)
Requirement already satisfied: python-dateutil>=2.7.3 in c:\users\saman\miniconda3\envs\env1\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.17.3 in c:\users\saman\miniconda3\envs\env1\lib\site-packages (from pandas) (1.22.0)
Requirement already satisfied: pytz>=2017.3 in c:\users\saman\miniconda3\envs\env1\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: six>=1.5 in c:\users\saman\miniconda3\envs\env1\lib\site-packages (from python-dateutil>=2.7.3->pandas) (1.16.0)

# How to Import Pandas

In [21]:
import pandas as pd
import numpy as np

# Series
list and dict to series<br>head</br> index, values<br>get by index (a.b)<br> p[:]<br>a.add, a.mul(b), a.div(b)</br>p.loc, p.iloc

In [15]:
p = pd.Series([10,11,10.2,11.2])
print(p)
print(p.head(2))
print(p.index)
print(p.values)
print(p[0:3])

0    10.0
1    11.0
2    10.2
3    11.2
dtype: float64
0    10.0
1    11.0
dtype: float64
RangeIndex(start=0, stop=4, step=1)
[10.  11.  10.2 11.2]
0    10.0
1    11.0
2    10.2
dtype: float64

In [16]:
p.add(2)

0    12.0
1    13.0
2    12.2
3    13.2
dtype: float64

In [20]:
p.iloc[0]

10.0

# DataFrame
DataFrame(data,columns )

In [34]:
p = pd.DataFrame(np.array(range(0,20)).reshape((4,5)), columns = ['c1', 'c2', 'c3','c4', 'c5'])
max(np.array(p.c5))
p

   c1  c2  c3  c4  c5
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14
3  15  16  17  18  19

# Select Row i

In [38]:
p.loc[0:2]

   c1  c2  c3  c4  c5
0   0   1   2   3   4
1   5   6   7   8   9
2  10  11  12  13  14

# Select Col j

In [39]:
p.c1

0     0
1     5
2    10
3    15
Name: c1, dtype: int32

# Select Row i, Col j

In [42]:
p.loc[[2]].c3

2    12
Name: c3, dtype: int32

# Sort Col Data
.sort_values(by, axis=0, ascending=True)

In [48]:
p.sort_values('c1', ascending=False)

   c1  c2  c3  c4  c5
3  15  16  17  18  19
2  10  11  12  13  14
1   5   6   7   8   9
0   0   1   2   3   4

# Missing Values
.isnull ,.notnull

In [50]:
p.notnull()

     c1    c2    c3    c4    c5
0  True  True  True  True  True
1  True  True  True  True  True
2  True  True  True  True  True
3  True  True  True  True  True

# Replace
.replace(old, new, inplace=True)

In [53]:
p.replace(0,100,inplace=True)

In [54]:
p

    c1  c2  c3  c4  c5
0  100   1   2   3   4
1    5   6   7   8   9
2   10  11  12  13  14
3   15  16  17  18  19

# Remove Col and Row with None Value
.dropna

In [55]:
p.dropna()

    c1  c2  c3  c4  c5
0  100   1   2   3   4
1    5   6   7   8   9
2   10  11  12  13  14
3   15  16  17  18  19